src/Reports/Продажи_ФиксМакет/Продажи_ФиксМакет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Продажи_ФиксМакет</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/Продажи_ФиксМакет/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТабДок.Очистить();
	
	Макет = Отчеты.Продажи_ФиксМакет.ПолучитьМакет("МакетОтчета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Организация КАК Организация,
		|	ПродажиОбороты.Контрагент КАК Контрагент,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.КоличествоОборот КАК Количество,
		|	ПродажиОбороты.СуммаОборот КАК Выручка,
		|	ПродажиОбороты.СебестоимостьОборот КАК Себестоимость,
		|	ПродажиОбороты.СуммаОборот - ПродажиОбороты.СебестоимостьОборот КАК Прибыль
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Выручка),
		|	СУММА(Себестоимость),
		|	СУММА(Прибыль)
		|ПО
		|	ОБЩИЕ,
		|	Организация,
		|	Контрагент";
	
	Если Отчет.ДатаНачала = '00010101' Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаНачала", "");
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", Отчет.ДатаНачала);	
	КонецЕсли; 
	
	Если Отчет.ДатаОкончания = '00010101' Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаОкончания", "");	
	Иначе
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.ДатаОкончания));
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//шапка таблицы
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(Область);
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаОрганизация = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		// Вставить обработку выборки ВыборкаОрганизация
		
		Область = Макет.ПолучитьОбласть("ГруппировкаОрганизация");
		Область.Параметры.Заполнить(ВыборкаОрганизация);
		ТабДок.Вывести(Область, ВыборкаОрганизация.Уровень());
		
		ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаКонтрагент.Следующий() Цикл
			// Вставить обработку выборки ВыборкаКонтрагент
			
			Область = Макет.ПолучитьОбласть("ГруппировкаКонтрагент");
			Область.Параметры.Заполнить(ВыборкаКонтрагент);
			ТабДок.Вывести(Область, ВыборкаКонтрагент.Уровень());
			
			ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Область = Макет.ПолучитьОбласть("ДетальныеЗаписи");
				Область.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				ТабДок.Вывести(Область, ВыборкаДетальныеЗаписи.Уровень());
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Область = Макет.ПолучитьОбласть("ОбщиеИтоги");
	Область.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(Область);	
	
КонецПроцедуры
